y=[1035       624       1084      1052     1015      1066      704        960       990       1050       839      1030     985       855];
x=[6.0000    2.5000    7.5000    8.5000   10.0000    7.0000    3.0000   11.5000    5.5000    6.5000    4.0000   9.0000   11.0000   12.5000];
plot(x,y,'+'),
pause
x2=x.^2;
X=[ones(14,1) x' x2']; %常数项、一次项、二次项的系数 
[b,bi,r,ri,s]=regress(y',X);
b,bi,s,
pause
xx=2:.1:13;
yy=b(1)+b(2)*xx+b(3)*xx.^2;
plot(x,y,'+',xx,yy),grid,
pause
a=polyfit(x,y,2)          % 注意与 regress 的区别
polytool(x,y,2)           

 